cmsis-svd/cmsis-svd/data/Microchip/ATSAMV71N.svd
            <register>
               <name>GMAC_ST2CW120</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 20)</description>
               <addressOffset>0x7A4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW021</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 21)</description>
               <addressOffset>0x7A8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW121</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 21)</description>
               <addressOffset>0x7AC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW022</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 22)</description>
               <addressOffset>0x7B0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW122</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 22)</description>
               <addressOffset>0x7B4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW023</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 23)</description>
               <addressOffset>0x7B8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW123</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 23)</description>
               <addressOffset>0x7BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
